# Создать калькулятор для работы с рациональными и комплексными числами, организовать меню добавив в него систему логирования.


from lesson7ui import a, op, b
from lesson7calc import result
print(f'{a}{op}{b} = {result}')